# 자료구조 : series와 dataframe

In [9]:
fruit=Series([2500, 3800, 1200, 6000])
fruit

0    2500
1    3800
2    1200
3    6000
dtype: int64

In [14]:
fruit=Series(['apple','banana','peer','cherry'], [2500, 3800, 1200, 6000])
fruit

2500     apple
3800    banana
1200      peer
6000    cherry
dtype: object

In [15]:
type(fruit)

pandas.core.series.Series

In [13]:
from pandas import Series, DataFrame

import pandas as pd

fruit=Series([2500, 3800, 1200, 6000], ['apple','banana','peer','cherry'])

print(fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [19]:
fruit=Series([2500, 3800, 1200, 6000], ['apple','banana','peer','cherry'])

fruit.values

array([2500, 3800, 1200, 6000], dtype=int64)

In [21]:
fruit.index

Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [22]:
fruitdata={ 'apple':2500, 'banana':3800, 'peer':1200, 'cherry':6000}

In [23]:
fruitdata

{'apple': 2500, 'banana': 3800, 'peer': 1200, 'cherry': 6000}

In [26]:
fruit=Series(fruitdata)

In [27]:
type(fruitdata)

dict

In [25]:
fruit

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

# value와 index 이름 지정하기 name

In [28]:
fruit=Series([2500, 3800, 1200, 6000], ['apple','banana','peer','cherry'])


fruit.name='fruitprice'

fruit.index.name='fruitName'

In [29]:
fruit

fruitName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitprice, dtype: int64

# Dataframe 구조

In [65]:
fruitData = {'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500, 3800, 6000, 1200], 
             'num':[10, 5, 3, 8]}

fruitFrame =DataFrame(fruitData)
print(fruitFrame)

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [36]:
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [39]:
import pandas as pd

print("pd ver= ", pd.__version__)

pd ver=  0.25.1

In [48]:
dir(pd)

['Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseArray',
 'SparseDataFrame',
 'SparseDtype',
 'SparseSeries',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'datetime',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'np',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_msgpack',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

# 특정항목 추출하기

In [66]:
sel_fruitName=fruitFrame['fruitName']; sel_fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [46]:
fruitFrame.fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [ ]:
# 컬럼 추가하기

In [63]:
fruitData = {'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500, 3800, 6000, 1200], 
             'num':[10, 5, 3, 8]}
fruitFrame['year']=2016
print(fruitFrame)

  fruitName fruitprice  num  stock  year
0     apple        NaN   10    4.0  2016
1    banana        NaN    5    NaN  2016
2    cherry        NaN    3    2.0  2016
3      peer        NaN    8    1.0  2016

In [61]:
fruitData = {'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500, 3800, 6000, 1200], 
             'num':[10, 5, 3, 8]}

fruitFrame=DataFrame(fruitData, columns=['fruitName', 'fruitprice', 'num'])
print(fruitFrame)

  fruitName fruitprice  num
0     apple        NaN   10
1    banana        NaN    5
2    cherry        NaN    3
3      peer        NaN    8

In [71]:
# 컬럼추가+값 넣기

variable=Series([4,2,1], index=[0,2,3])

fruitFrame['stock']=variable
fruitFrame

        fruitPrice  num  stock
apple         2500   10    NaN
banana        3800    5    NaN
cherry        6000    3    NaN
peer          1200    8    NaN

# dataframe row 삭제하기 drop()

In [69]:
fruit=Series([2500,3800,1200,6000], index=['apple','banana','peer','cherry'])
new_fruit =fruit.drop('banana')
print(fruit)

print('-'*20)
print(new_fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64
--------------------
apple     2500
peer      1200
cherry    6000
dtype: int64

In [73]:
fruitData={'fruitName':['apple','banana','cherry','peer'], 'fruitPrice':[2500, 3800, 6000, 1200],
           'num':[10,5,3,8]}

fruitName=fruitData['fruitName']
fruitFrame= DataFrame(fruitData, index=fruitName, columns=['fruitPrice','num'])
fruitFrame2=fruitFrame.drop(['apple','cherry'])

print(fruitFrame)
print(fruitFrame2)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
        fruitPrice  num
banana        3800    5
peer          1200    8

# dataframe column 삭제하기 drop()

In [77]:
fruitFrame3=fruitFrame.drop('num',axis=1)
print(fruitFrame)
print(fruitFrame3)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [81]:
fruitFrame3=fruitFrame.copy()
aa = ['num']
fruitFrame3.drop(aa, axis=1, inplace=False)
print(fruitFrame)
print('-'*40)
print(fruitFrame3)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
----------------------------------------
        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [92]:
import numpy as np

x1=np.arange(24).reshape((4,3,2));x1

array([[[ 0,  1],
        [ 2,  3],
        [ 4,  5]],

       [[ 6,  7],
        [ 8,  9],
        [10, 11]],

       [[12, 13],
        [14, 15],
        [16, 17]],

       [[18, 19],
        [20, 21],
        [22, 23]]])

# dataframe의 slice

In [96]:


fruitData={'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500, 3800, 6000, 1200], 'num':[10,5,3,8]}

fruitName=fruitData['fruitName']
fruitFrame= DataFrame(fruitData, index = fruitName, columns=['fruitPrice','num'])
print(fruitFrame)
fruitFrame['fruitPrice']

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

In [98]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

# series의 연산

In [100]:
fruit1=Series([5,9,10,3], index=['apple','banana','cherry','peer'])
fruit2=Series([3,2,9,5,10], index =['apple', 'orange', 'banana', 'cherry', 'mango'])
print(fruit1)
print(fruit2)
fruit1 + fruit2

apple      5
banana     9
cherry    10
peer       3
dtype: int64
apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [103]:
fruit=Series([5,9,10,3], index=['apple','banana','cherry','peer'])

fruit.sort_values(ascending=True)

peer       3
apple      5
banana     9
cherry    10
dtype: int64

In [105]:
fruit=Series([5,9,10,3], index=['apple','banana','cherry','peer'])

fruit.sort_values(ascending=False)

cherry    10
banana     9
apple      5
peer       3
dtype: int64

In [108]:
fruitFrame.sort_index()

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [110]:
fruitFrame.sort_index(axis = 1)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [114]:
fruitData={'fruitName':['apple','banana','cherry','peer'],'fruitPrice':[2500, 3800, 6000, 1200], 'num':[10,5,3,8]}

fruitName=fruitData['fruitName']
fruitFrame= DataFrame(fruitData, index = fruitName, columns=['num','fruitPrice',])

print(fruitFrame)
fruitFrame.sort_index()

        num  fruitPrice
apple    10        2500
banana    5        3800
cherry    3        6000
peer      8        1200

        num  fruitPrice
apple    10        2500
banana    5        3800
cherry    3        6000
peer      8        1200

In [116]:
fruitFrame.sort_index(axis=1)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

# German credit data 입력

In [123]:
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv")

list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [125]:
german.shape

(1000, 21)

In [129]:
german.columns

Index(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose', 'Credit Amount',
       'Value Savings/Stocks', 'Length of current employment',
       'Instalment per cent', 'Sex & Marital Status', 'Guarantors',
       'Duration in Current address', 'Most valuable available asset',
       'Age (years)', 'Concurrent Credits', 'Type of apartment',
       'No of Credits at this Bank', 'Occupation', 'No of dependents',
       'Telephone', 'Foreign Worker'],
      dtype='object')

In [131]:
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [137]:
german_sample=DataFrame(german, columns=['Creditability', 'Duration of Credit (month)', 'Purpose',
                                        'Credit Amount'])

german_sample.min()

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [141]:
german_sample=german[['Creditability','Duration of Credit (month)', 'Purpose', 'Credit Amount']]

german_sample.head(10)

   Creditability  Duration of Credit (month)  Purpose  Credit Amount
0              1                          18        2           1049
1              1                           9        0           2799
2              1                          12        9            841
3              1                          12        0           2122
4              1                          12        0           2171
5              1                          10        0           2241
6              1                           8        0           3398
7              1                           6        0           1361
8              1                          18        3           1098
9              1                          24        3           3758

In [143]:
german_sample.describe()

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000

In [146]:
german_sample=german[['Duration of Credit (month)', 'Credit Amount','Age (years)']]

german_sample.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [147]:
german_sample.cov()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119